Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/
#include "pdm_pcm_definitions.h"

#if !USE_RT1050_EVKB

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
#define BOARD_INITPINS_LCDIF_D0_GPIO                                       GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_D0_PORT                                       GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_D0_GPIO_PIN                                      4U   /*!< GPIO2 pin index: 4 */
#define BOARD_INITPINS_LCDIF_D0_PIN_NAME                              GPIO_B0_04   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_D0_LABEL                       "LCDIF_D0/BT_CFG[0]"   /*!< Label */
#define BOARD_INITPINS_LCDIF_D0_NAME                                  "LCDIF_D0"   /*!< Identifier name */
#define BOARD_INITPINS_LCDIF_D0_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
#define BOARD_INITPINS_LCDIF_D5_GPIO                                       GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_D5_PORT                                       GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_D5_GPIO_PIN                                      9U   /*!< GPIO2 pin index: 9 */
#define BOARD_INITPINS_LCDIF_D5_PIN_NAME                              GPIO_B0_09   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_D5_LABEL                       "LCDIF_D5/BT_CFG[5]"   /*!< Label */
#define BOARD_INITPINS_LCDIF_D5_NAME                                  "LCDIF_D5"   /*!< Identifier name */
#define BOARD_INITPINS_LCDIF_D5_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
#define BOARD_INITMICROPHONE_LCDIF_D7_PERIPHERAL                            SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D7_SIGNAL                        sai_tx_data2   /*!< SAI1 signal: sai_tx_data2 */
#define BOARD_INITMICROPHONE_LCDIF_D7_PIN_NAME                        GPIO_B0_11   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D7_LABEL                 "LCDIF_D7/BT_CFG[7]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D7_NAME                            "LCDIF_D7"   /*!< Identifier name */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
#define BOARD_INITMICROPHONE_LCDIF_D12_PERIPHERAL                           SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D12_SIGNAL                       sai_rx_data0   /*!< SAI1 signal: sai_rx_data0 */
#define BOARD_INITMICROPHONE_LCDIF_D12_PIN_NAME                       GPIO_B1_00   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D12_LABEL                         "LCDIF_D12"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D12_NAME                          "LCDIF_D12"   /*!< Identifier name */

/* GPIO_EMC_39 (coord B7), SEMC_DQS */
#define BOARD_INITMICROPHONE_SEMC_DQS_PERIPHERAL                            SAI3   /*!< Device name: SAI3 */
#define BOARD_INITMICROPHONE_SEMC_DQS_SIGNAL                         sai_tx_sync   /*!< SAI3 signal: sai_tx_sync */
#define BOARD_INITMICROPHONE_SEMC_DQS_PIN_NAME                       GPIO_EMC_39   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_DQS_LABEL                           "SEMC_DQS"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_DQS_NAME                            "SEMC_DQS"   /*!< Identifier name */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
#define BOARD_INITMICROPHONE_LCDIF_D8_PERIPHERAL                            SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D8_SIGNAL                        sai_tx_data1   /*!< SAI1 signal: sai_tx_data1 */
#define BOARD_INITMICROPHONE_LCDIF_D8_PIN_NAME                        GPIO_B0_12   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D8_LABEL                 "LCDIF_D8/BT_CFG[8]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D8_NAME                            "LCDIF_D8"   /*!< Identifier name */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
#define BOARD_INITMICROPHONE_SEMC_D14_PERIPHERAL                            SAI3   /*!< Device name: SAI3 */
#define BOARD_INITMICROPHONE_SEMC_D14_SIGNAL                         sai_tx_data   /*!< SAI3 signal: sai_tx_data */
#define BOARD_INITMICROPHONE_SEMC_D14_PIN_NAME                       GPIO_EMC_36   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_D14_LABEL                           "SEMC_D14"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_D14_NAME                            "SEMC_D14"   /*!< Identifier name */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
#define BOARD_INITMICROPHONE_SEMC_D11_PERIPHERAL                            SAI3   /*!< Device name: SAI3 */
#define BOARD_INITMICROPHONE_SEMC_D11_SIGNAL                         sai_rx_data   /*!< SAI3 signal: sai_rx_data */
#define BOARD_INITMICROPHONE_SEMC_D11_PIN_NAME                       GPIO_EMC_33   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_D11_LABEL                           "SEMC_D11"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_D11_NAME                            "SEMC_D11"   /*!< Identifier name */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
#define BOARD_INITMICROPHONE_LCDIF_D9_PERIPHERAL                            SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D9_SIGNAL                            sai_mclk   /*!< SAI1 signal: sai_mclk */
#define BOARD_INITMICROPHONE_LCDIF_D9_PIN_NAME                        GPIO_B0_13   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D9_LABEL                 "LCDIF_D9/BT_CFG[9]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D9_NAME                            "LCDIF_D9"   /*!< Identifier name */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
#define BOARD_INITMICROPHONE_LCDIF_D11_PERIPHERAL                           SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D11_SIGNAL                        sai_rx_bclk   /*!< SAI1 signal: sai_rx_bclk */
#define BOARD_INITMICROPHONE_LCDIF_D11_PIN_NAME                       GPIO_B0_15   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D11_LABEL              "LCDIF_D11/BT_CFG[11]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D11_NAME                          "LCDIF_D11"   /*!< Identifier name */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
#define BOARD_INITMICROPHONE_LCDIF_D6_PERIPHERAL                            SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D6_SIGNAL                        sai_tx_data3   /*!< SAI1 signal: sai_tx_data3 */
#define BOARD_INITMICROPHONE_LCDIF_D6_PIN_NAME                        GPIO_B0_10   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D6_LABEL                 "LCDIF_D6/BT_CFG[6]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D6_NAME                            "LCDIF_D6"   /*!< Identifier name */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
#define BOARD_INITMICROPHONE_LCDIF_D10_PERIPHERAL                           SAI1   /*!< Device name: SAI1 */
#define BOARD_INITMICROPHONE_LCDIF_D10_SIGNAL                        sai_rx_sync   /*!< SAI1 signal: sai_rx_sync */
#define BOARD_INITMICROPHONE_LCDIF_D10_PIN_NAME                       GPIO_B0_14   /*!< Pin name */
#define BOARD_INITMICROPHONE_LCDIF_D10_LABEL              "LCDIF_D10/BT_CFG[10]"   /*!< Label */
#define BOARD_INITMICROPHONE_LCDIF_D10_NAME                          "LCDIF_D10"   /*!< Identifier name */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
#define BOARD_INITMICROPHONE_SEMC_A1_PERIPHERAL                             SAI2   /*!< Device name: SAI2 */
#define BOARD_INITMICROPHONE_SEMC_A1_SIGNAL                          sai_rx_bclk   /*!< SAI2 signal: sai_rx_bclk */
#define BOARD_INITMICROPHONE_SEMC_A1_PIN_NAME                        GPIO_EMC_10   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_A1_LABEL                             "SEMC_A1"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_A1_NAME                              "SEMC_A1"   /*!< Identifier name */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
#define BOARD_INITMICROPHONE_SEMC_D15_PERIPHERAL                            SAI3   /*!< Device name: SAI3 */
#define BOARD_INITMICROPHONE_SEMC_D15_SIGNAL                            sai_mclk   /*!< SAI3 signal: sai_mclk */
#define BOARD_INITMICROPHONE_SEMC_D15_PIN_NAME                       GPIO_EMC_37   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_D15_LABEL                           "SEMC_D15"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_D15_NAME                            "SEMC_D15"   /*!< Identifier name */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
#define BOARD_INITMICROPHONE_SEMC_DM1_PERIPHERAL                            SAI3   /*!< Device name: SAI3 */
#define BOARD_INITMICROPHONE_SEMC_DM1_SIGNAL                         sai_tx_bclk   /*!< SAI3 signal: sai_tx_bclk */
#define BOARD_INITMICROPHONE_SEMC_DM1_PIN_NAME                       GPIO_EMC_38   /*!< Pin name */
#define BOARD_INITMICROPHONE_SEMC_DM1_LABEL                           "SEMC_DM1"   /*!< Label */
#define BOARD_INITMICROPHONE_SEMC_DM1_NAME                            "SEMC_DM1"   /*!< Identifier name */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
#define BOARD_INITMICROPHONE_CSI_D6_GPIO                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITMICROPHONE_CSI_D6_PORT                                   GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITMICROPHONE_CSI_D6_GPIO_PIN                                 27U   /*!< GPIO1 pin index: 27 */
#define BOARD_INITMICROPHONE_CSI_D6_PIN_NAME                       GPIO_AD_B1_11   /*!< Pin name */
#define BOARD_INITMICROPHONE_CSI_D6_LABEL    "SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2]"   /*!< Label */
#define BOARD_INITMICROPHONE_CSI_D6_NAME                                "CSI_D6"   /*!< Identifier name */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
#define BOARD_INITMICROPHONE_CSI_D3_GPIO                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITMICROPHONE_CSI_D3_PORT                                   GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITMICROPHONE_CSI_D3_GPIO_PIN                                 30U   /*!< GPIO1 pin index: 30 */
#define BOARD_INITMICROPHONE_CSI_D3_PIN_NAME                       GPIO_AD_B1_14   /*!< Pin name */
#define BOARD_INITMICROPHONE_CSI_D3_LABEL   "SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12]"   /*!< Label */
#define BOARD_INITMICROPHONE_CSI_D3_NAME                                "CSI_D3"   /*!< Identifier name */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
#define BOARD_INITMICROPHONE_SPDIF_IN_GPIO                                 GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITMICROPHONE_SPDIF_IN_PORT                                 GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITMICROPHONE_SPDIF_IN_GPIO_PIN                               19U   /*!< GPIO1 pin index: 19 */
#define BOARD_INITMICROPHONE_SPDIF_IN_PIN_NAME                     GPIO_AD_B1_03   /*!< Pin name */
#define BOARD_INITMICROPHONE_SPDIF_IN_LABEL                    "SPDIF_IN/J22[8]"   /*!< Label */
#define BOARD_INITMICROPHONE_SPDIF_IN_NAME                            "SPDIF_IN"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMicrophone(void);

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
#define BOARD_INITETHERNET_ENET_CRS_DV_PERIPHERAL                           ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_CRS_DV_SIGNAL                         enet_rx_en   /*!< ENET signal: enet_rx_en */
#define BOARD_INITETHERNET_ENET_CRS_DV_PIN_NAME                       GPIO_B1_06   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_CRS_DV_LABEL                       "ENET_CRS_DV"   /*!< Label */
#define BOARD_INITETHERNET_ENET_CRS_DV_NAME                        "ENET_CRS_DV"   /*!< Identifier name */

/* GPIO_EMC_40 (coord A7), ENET_MDC */
#define BOARD_INITETHERNET_ENET_MDC_PERIPHERAL                              ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_MDC_SIGNAL                              enet_mdc   /*!< ENET signal: enet_mdc */
#define BOARD_INITETHERNET_ENET_MDC_PIN_NAME                         GPIO_EMC_40   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_MDC_LABEL                             "ENET_MDC"   /*!< Label */
#define BOARD_INITETHERNET_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
#define BOARD_INITETHERNET_ENET_MDIO_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_MDIO_SIGNAL                            enet_mdio   /*!< ENET signal: enet_mdio */
#define BOARD_INITETHERNET_ENET_MDIO_PIN_NAME                        GPIO_EMC_41   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_MDIO_LABEL                           "ENET_MDIO"   /*!< Label */
#define BOARD_INITETHERNET_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier name */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
#define BOARD_INITETHERNET_ENET_TX_CLK_PERIPHERAL                           ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_TX_CLK_SIGNAL                       enet_ref_clk   /*!< ENET signal: enet_ref_clk */
#define BOARD_INITETHERNET_ENET_TX_CLK_PIN_NAME                       GPIO_B1_10   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_TX_CLK_LABEL                       "ENET_TX_CLK"   /*!< Label */
#define BOARD_INITETHERNET_ENET_TX_CLK_NAME                        "ENET_TX_CLK"   /*!< Identifier name */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
#define BOARD_INITETHERNET_ENET_RXD0_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITETHERNET_ENET_RXD0_CHANNEL                                  0U   /*!< ENET enet_rx_data channel: 0 */
#define BOARD_INITETHERNET_ENET_RXD0_PIN_NAME                         GPIO_B1_04   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_RXD0_LABEL                           "ENET_RXD0"   /*!< Label */
#define BOARD_INITETHERNET_ENET_RXD0_NAME                            "ENET_RXD0"   /*!< Identifier name */

