Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.h
/* GPIO_B1_05 (coord D12), ENET_RXD1 */
#define BOARD_INITETHERNET_ENET_RXD1_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_RXD1_SIGNAL                         enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITETHERNET_ENET_RXD1_CHANNEL                                  1U   /*!< ENET enet_rx_data channel: 1 */
#define BOARD_INITETHERNET_ENET_RXD1_PIN_NAME                         GPIO_B1_05   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_RXD1_LABEL                           "ENET_RXD1"   /*!< Label */
#define BOARD_INITETHERNET_ENET_RXD1_NAME                            "ENET_RXD1"   /*!< Identifier name */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
#define BOARD_INITETHERNET_ENET_TXD0_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_TXD0_SIGNAL                         enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITETHERNET_ENET_TXD0_CHANNEL                                  0U   /*!< ENET enet_tx_data channel: 0 */
#define BOARD_INITETHERNET_ENET_TXD0_PIN_NAME                         GPIO_B1_07   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_TXD0_LABEL                           "ENET_TXD0"   /*!< Label */
#define BOARD_INITETHERNET_ENET_TXD0_NAME                            "ENET_TXD0"   /*!< Identifier name */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
#define BOARD_INITETHERNET_ENET_TXD1_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_TXD1_SIGNAL                         enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITETHERNET_ENET_TXD1_CHANNEL                                  1U   /*!< ENET enet_tx_data channel: 1 */
#define BOARD_INITETHERNET_ENET_TXD1_PIN_NAME                         GPIO_B1_08   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_TXD1_LABEL                           "ENET_TXD1"   /*!< Label */
#define BOARD_INITETHERNET_ENET_TXD1_NAME                            "ENET_TXD1"   /*!< Identifier name */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
#define BOARD_INITETHERNET_ENET_TXEN_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITETHERNET_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< ENET signal: enet_tx_en */
#define BOARD_INITETHERNET_ENET_TXEN_PIN_NAME                         GPIO_B1_09   /*!< Pin name */
#define BOARD_INITETHERNET_ENET_TXEN_LABEL                           "ENET_TXEN"   /*!< Label */
#define BOARD_INITETHERNET_ENET_TXEN_NAME                            "ENET_TXEN"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEthernet(void);

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
#define BOARD_INITFLASH_SEMC_D6_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITFLASH_SEMC_D6_SIGNAL                                         A   /*!< PWM2 signal: A */
#define BOARD_INITFLASH_SEMC_D6_CHANNEL                                       0U   /*!< PWM2 A channel: 0 */
#define BOARD_INITFLASH_SEMC_D6_PIN_NAME                             GPIO_EMC_06   /*!< Pin name */
#define BOARD_INITFLASH_SEMC_D6_LABEL                                  "SEMC_D6"   /*!< Label */
#define BOARD_INITFLASH_SEMC_D6_NAME                                   "SEMC_D6"   /*!< Identifier name */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
#define BOARD_INITFLASH_SEMC_DM0_PERIPHERAL                                 PWM2   /*!< Device name: PWM2 */
#define BOARD_INITFLASH_SEMC_DM0_SIGNAL                                        A   /*!< PWM2 signal: A */
#define BOARD_INITFLASH_SEMC_DM0_CHANNEL                                      1U   /*!< PWM2 A channel: 1 */
#define BOARD_INITFLASH_SEMC_DM0_PIN_NAME                            GPIO_EMC_08   /*!< Pin name */
#define BOARD_INITFLASH_SEMC_DM0_LABEL                                "SEMC_DM0"   /*!< Label */
#define BOARD_INITFLASH_SEMC_DM0_NAME                                 "SEMC_DM0"   /*!< Identifier name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
#define BOARD_INITFLASH_FlexSPI_CLK_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_CLK_SIGNAL                        FLEXSPI_A_SCLK   /*!< FLEXSPI signal: FLEXSPI_A_SCLK */
#define BOARD_INITFLASH_FlexSPI_CLK_PIN_NAME                       GPIO_SD_B1_07   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_CLK_LABEL                          "FlexSPI_CLK"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_CLK_NAME                           "FlexSPI_CLK"   /*!< Identifier name */

/* GPIO_SD_B1_04 (coord P2), FlexSPI_CLK_B */
#define BOARD_INITFLASH_FlexSPI_CLK_B_PERIPHERAL                         FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_CLK_B_SIGNAL                      FLEXSPI_B_SCLK   /*!< FLEXSPI signal: FLEXSPI_B_SCLK */
#define BOARD_INITFLASH_FlexSPI_CLK_B_PIN_NAME                     GPIO_SD_B1_04   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_CLK_B_LABEL                      "FlexSPI_CLK_B"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_CLK_B_NAME                       "FlexSPI_CLK_B"   /*!< Identifier name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
#define BOARD_INITFLASH_FlexSPI_D0_A_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D0_A_SIGNAL                      FLEXSPI_A_DATA0   /*!< FLEXSPI signal: FLEXSPI_A_DATA0 */
#define BOARD_INITFLASH_FlexSPI_D0_A_PIN_NAME                      GPIO_SD_B1_08   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D0_A_LABEL                        "FlexSPI_D0_A"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D0_A_NAME                         "FlexSPI_D0_A"   /*!< Identifier name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
#define BOARD_INITFLASH_FlexSPI_D1_A_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D1_A_SIGNAL                      FLEXSPI_A_DATA1   /*!< FLEXSPI signal: FLEXSPI_A_DATA1 */
#define BOARD_INITFLASH_FlexSPI_D1_A_PIN_NAME                      GPIO_SD_B1_09   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D1_A_LABEL                        "FlexSPI_D1_A"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D1_A_NAME                         "FlexSPI_D1_A"   /*!< Identifier name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
#define BOARD_INITFLASH_FlexSPI_D2_A_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D2_A_SIGNAL                      FLEXSPI_A_DATA2   /*!< FLEXSPI signal: FLEXSPI_A_DATA2 */
#define BOARD_INITFLASH_FlexSPI_D2_A_PIN_NAME                      GPIO_SD_B1_10   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D2_A_LABEL                        "FlexSPI_D2_A"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D2_A_NAME                         "FlexSPI_D2_A"   /*!< Identifier name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
#define BOARD_INITFLASH_FlexSPI_D3_A_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D3_A_SIGNAL                      FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */
#define BOARD_INITFLASH_FlexSPI_D3_A_PIN_NAME                      GPIO_SD_B1_11   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D3_A_LABEL                        "FlexSPI_D3_A"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D3_A_NAME                         "FlexSPI_D3_A"   /*!< Identifier name */

/* GPIO_SD_B1_03 (coord M4), FlexSPI_D0_B */
#define BOARD_INITFLASH_FlexSPI_D0_B_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D0_B_SIGNAL                      FLEXSPI_B_DATA0   /*!< FLEXSPI signal: FLEXSPI_B_DATA0 */
#define BOARD_INITFLASH_FlexSPI_D0_B_PIN_NAME                      GPIO_SD_B1_03   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D0_B_LABEL                        "FlexSPI_D0_B"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D0_B_NAME                         "FlexSPI_D0_B"   /*!< Identifier name */

