Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.h
/* GPIO_SD_B1_02 (coord M3), FlexSPI_D1_B */
#define BOARD_INITFLASH_FlexSPI_D1_B_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D1_B_SIGNAL                      FLEXSPI_B_DATA1   /*!< FLEXSPI signal: FLEXSPI_B_DATA1 */
#define BOARD_INITFLASH_FlexSPI_D1_B_PIN_NAME                      GPIO_SD_B1_02   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D1_B_LABEL                        "FlexSPI_D1_B"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D1_B_NAME                         "FlexSPI_D1_B"   /*!< Identifier name */

/* GPIO_SD_B1_01 (coord M5), FlexSPI_D2_B */
#define BOARD_INITFLASH_FlexSPI_D2_B_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D2_B_SIGNAL                      FLEXSPI_B_DATA2   /*!< FLEXSPI signal: FLEXSPI_B_DATA2 */
#define BOARD_INITFLASH_FlexSPI_D2_B_PIN_NAME                      GPIO_SD_B1_01   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D2_B_LABEL                        "FlexSPI_D2_B"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D2_B_NAME                         "FlexSPI_D2_B"   /*!< Identifier name */

/* GPIO_SD_B1_00 (coord L5), FlexSPI_D3_B */
#define BOARD_INITFLASH_FlexSPI_D3_B_PERIPHERAL                          FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_D3_B_SIGNAL                      FLEXSPI_B_DATA3   /*!< FLEXSPI signal: FLEXSPI_B_DATA3 */
#define BOARD_INITFLASH_FlexSPI_D3_B_PIN_NAME                      GPIO_SD_B1_00   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_D3_B_LABEL                        "FlexSPI_D3_B"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_D3_B_NAME                         "FlexSPI_D3_B"   /*!< Identifier name */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
#define BOARD_INITFLASH_FlexSPI_DQS_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_DQS_SIGNAL                         FLEXSPI_A_DQS   /*!< FLEXSPI signal: FLEXSPI_A_DQS */
#define BOARD_INITFLASH_FlexSPI_DQS_PIN_NAME                       GPIO_SD_B1_05   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_DQS_LABEL                          "FlexSPI_DQS"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_DQS_NAME                           "FlexSPI_DQS"   /*!< Identifier name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
#define BOARD_INITFLASH_FlexSPI_SS0_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITFLASH_FlexSPI_SS0_SIGNAL                       FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */
#define BOARD_INITFLASH_FlexSPI_SS0_PIN_NAME                       GPIO_SD_B1_06   /*!< Pin name */
#define BOARD_INITFLASH_FlexSPI_SS0_LABEL                          "FlexSPI_SS0"   /*!< Label */
#define BOARD_INITFLASH_FlexSPI_SS0_NAME                           "FlexSPI_SS0"   /*!< Identifier name */

/* GPIO_AD_B0_05 (coord G14), Flash_RST */
#define BOARD_INITFLASH_CAN_STBY_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITFLASH_CAN_STBY_PORT                                      GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITFLASH_CAN_STBY_GPIO_PIN                                     5U   /*!< GPIO1 pin index: 5 */
#define BOARD_INITFLASH_CAN_STBY_PIN_NAME                          GPIO_AD_B0_05   /*!< Pin name */
#define BOARD_INITFLASH_CAN_STBY_LABEL                               "Flash_RST"   /*!< Label */
#define BOARD_INITFLASH_CAN_STBY_NAME                                 "CAN_STBY"   /*!< Identifier name */
#define BOARD_INITFLASH_CAN_STBY_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlash(void);

/* GPIO_AD_B0_11 (coord G10), JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9] */
#define BOARD_INITTJTAG_INT2_COMBO_PERIPHERAL                               JTAG   /*!< Device name: JTAG */
#define BOARD_INITTJTAG_INT2_COMBO_SIGNAL                                  TRSTB   /*!< JTAG signal: TRSTB */
#define BOARD_INITTJTAG_INT2_COMBO_PIN_NAME                        GPIO_AD_B0_11   /*!< Pin name */
#define BOARD_INITTJTAG_INT2_COMBO_LABEL "JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9]" /*!< Label */
#define BOARD_INITTJTAG_INT2_COMBO_NAME                             "INT2_COMBO"   /*!< Identifier name */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J21[13]/INT1_COMBO/ENET_INT/J22[6]/U32[11] */
#define BOARD_INITTJTAG_INT1_COMBO_PERIPHERAL                               JTAG   /*!< Device name: JTAG */
#define BOARD_INITTJTAG_INT1_COMBO_SIGNAL                                    TDO   /*!< JTAG signal: TDO */
#define BOARD_INITTJTAG_INT1_COMBO_PIN_NAME                        GPIO_AD_B0_10   /*!< Pin name */
#define BOARD_INITTJTAG_INT1_COMBO_LABEL "JTAG_TDO/J21[13]/INT1_COMBO/ENET_INT/J22[6]/U32[11]" /*!< Label */
#define BOARD_INITTJTAG_INT1_COMBO_NAME                             "INT1_COMBO"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InittJtag(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPI2C(void);

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
#define BOARD_INITLPSPI_CSI_D5_PERIPHERAL                                 LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITLPSPI_CSI_D5_SIGNAL                                       PCS0   /*!< LPSPI3 signal: PCS0 */
#define BOARD_INITLPSPI_CSI_D5_PIN_NAME                            GPIO_AD_B1_12   /*!< Pin name */
#define BOARD_INITLPSPI_CSI_D5_LABEL            "SAI1_RXD/CSI_D5/J35[5]/U13[16]"   /*!< Label */
#define BOARD_INITLPSPI_CSI_D5_NAME                                     "CSI_D5"   /*!< Identifier name */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
#define BOARD_INITLPSPI_CSI_D2_PERIPHERAL                                 LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITLPSPI_CSI_D2_SIGNAL                                        SCK   /*!< LPSPI3 signal: SCK */
#define BOARD_INITLPSPI_CSI_D2_PIN_NAME                            GPIO_AD_B1_15   /*!< Pin name */
#define BOARD_INITLPSPI_CSI_D2_LABEL        "SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13]"   /*!< Label */
#define BOARD_INITLPSPI_CSI_D2_NAME                                     "CSI_D2"   /*!< Identifier name */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
#define BOARD_INITLPSPI_CSI_D4_PERIPHERAL                                 LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITLPSPI_CSI_D4_SIGNAL                                        SDI   /*!< LPSPI3 signal: SDI */
#define BOARD_INITLPSPI_CSI_D4_PIN_NAME                            GPIO_AD_B1_13   /*!< Pin name */
#define BOARD_INITLPSPI_CSI_D4_LABEL            "SAI1_TXD/CSI_D4/J35[3]/U13[14]"   /*!< Label */
#define BOARD_INITLPSPI_CSI_D4_NAME                                     "CSI_D4"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPSPI(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);

/* GPIO_AD_B0_04 (coord F11), BOOT_MODE[0] */
#define BOARD_INITBOOTPIN_CSI_PWDN_GPIO                                    GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITBOOTPIN_CSI_PWDN_PORT                                    GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITBOOTPIN_CSI_PWDN_GPIO_PIN                                   4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITBOOTPIN_CSI_PWDN_PIN_NAME                        GPIO_AD_B0_04   /*!< Pin name */
#define BOARD_INITBOOTPIN_CSI_PWDN_LABEL                          "BOOT_MODE[0]"   /*!< Label */
#define BOARD_INITBOOTPIN_CSI_PWDN_NAME                               "CSI_PWDN"   /*!< Identifier name */
#define BOARD_INITBOOTPIN_CSI_PWDN_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_GPIO                               GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_PORT                               GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_GPIO_PIN                             31U   /*!< GPIO2 pin index: 31 */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_PIN_NAME                      GPIO_B1_15   /*!< Pin name */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_LABEL                     "USB_HOST_PWR"   /*!< Label */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_NAME                     "BACKLIGHT_CTL"   /*!< Identifier name */
#define BOARD_INITBOOTPIN_BACKLIGHT_CTL_DIRECTION       kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
#define BOARD_INITBOOTPIN_SD0_VSELECT_GPIO                                 GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITBOOTPIN_SD0_VSELECT_PORT                                 GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITBOOTPIN_SD0_VSELECT_GPIO_PIN                               30U   /*!< GPIO2 pin index: 30 */
#define BOARD_INITBOOTPIN_SD0_VSELECT_PIN_NAME                        GPIO_B1_14   /*!< Pin name */
#define BOARD_INITBOOTPIN_SD0_VSELECT_LABEL                        "SD0_VSELECT"   /*!< Label */
#define BOARD_INITBOOTPIN_SD0_VSELECT_NAME                         "SD0_VSELECT"   /*!< Identifier name */
#define BOARD_INITBOOTPIN_SD0_VSELECT_DIRECTION         kPIN_MUX_DirectionOutput   /*!< Direction */

