Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.h
/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
#define BOARD_INITBOOTPIN_CAN2_TX_PERIPHERAL                             LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITBOOTPIN_CAN2_TX_SIGNAL                                   CTS_B   /*!< LPUART1 signal: CTS_B */
#define BOARD_INITBOOTPIN_CAN2_TX_PIN_NAME                         GPIO_AD_B0_14   /*!< Pin name */
#define BOARD_INITBOOTPIN_CAN2_TX_LABEL                         "CAN2_TX/U12[1]"   /*!< Label */
#define BOARD_INITBOOTPIN_CAN2_TX_NAME                                 "CAN2_TX"   /*!< Identifier name */

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4] */
#define BOARD_INITBOOTPIN_CAN2_RX_PERIPHERAL                             LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITBOOTPIN_CAN2_RX_SIGNAL                                   RTS_B   /*!< LPUART1 signal: RTS_B */
#define BOARD_INITBOOTPIN_CAN2_RX_PIN_NAME                         GPIO_AD_B0_15   /*!< Pin name */
#define BOARD_INITBOOTPIN_CAN2_RX_LABEL                         "CAN2_RX/U12[4]"   /*!< Label */
#define BOARD_INITBOOTPIN_CAN2_RX_NAME                                 "CAN2_RX"   /*!< Identifier name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITBOOTPIN_UART1_RXD_PERIPHERAL                           LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITBOOTPIN_UART1_RXD_SIGNAL                                    RX   /*!< LPUART1 signal: RX */
#define BOARD_INITBOOTPIN_UART1_RXD_PIN_NAME                       GPIO_AD_B0_13   /*!< Pin name */
#define BOARD_INITBOOTPIN_UART1_RXD_LABEL                            "UART1_RXD"   /*!< Label */
#define BOARD_INITBOOTPIN_UART1_RXD_NAME                             "UART1_RXD"   /*!< Identifier name */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITBOOTPIN_UART1_TXD_PERIPHERAL                           LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITBOOTPIN_UART1_TXD_SIGNAL                                    TX   /*!< LPUART1 signal: TX */
#define BOARD_INITBOOTPIN_UART1_TXD_PIN_NAME                       GPIO_AD_B0_12   /*!< Pin name */
#define BOARD_INITBOOTPIN_UART1_TXD_LABEL                            "UART1_TXD"   /*!< Label */
#define BOARD_INITBOOTPIN_UART1_TXD_NAME                             "UART1_TXD"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/* WAKEUP (coord L6), SD_PWREN */
#define BOARD_INITWIFI_SD_PWREN_GPIO                                       GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITWIFI_SD_PWREN_PORT                                       GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITWIFI_SD_PWREN_GPIO_PIN                                      0U   /*!< GPIO5 pin index: 0 */
#define BOARD_INITWIFI_SD_PWREN_PIN_NAME                                  WAKEUP   /*!< Pin name */
#define BOARD_INITWIFI_SD_PWREN_LABEL                                 "SD_PWREN"   /*!< Label */
#define BOARD_INITWIFI_SD_PWREN_NAME                                  "SD_PWREN"   /*!< Identifier name */
#define BOARD_INITWIFI_SD_PWREN_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* PMIC_ON_REQ (coord K7), PMIC_ON_REQ */
#define BOARD_INITWIFI_PMIC_ON_REQ_GPIO                                    GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITWIFI_PMIC_ON_REQ_PORT                                    GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITWIFI_PMIC_ON_REQ_GPIO_PIN                                   1U   /*!< GPIO5 pin index: 1 */
#define BOARD_INITWIFI_PMIC_ON_REQ_PIN_NAME                          PMIC_ON_REQ   /*!< Pin name */
#define BOARD_INITWIFI_PMIC_ON_REQ_LABEL                           "PMIC_ON_REQ"   /*!< Label */
#define BOARD_INITWIFI_PMIC_ON_REQ_NAME                            "PMIC_ON_REQ"   /*!< Identifier name */
#define BOARD_INITWIFI_PMIC_ON_REQ_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
#define BOARD_INITWIFI_SD1_CLK_PERIPHERAL                                 USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITWIFI_SD1_CLK_SIGNAL                                  usdhc_clk   /*!< USDHC1 signal: usdhc_clk */
#define BOARD_INITWIFI_SD1_CLK_PIN_NAME                            GPIO_SD_B0_01   /*!< Pin name */
#define BOARD_INITWIFI_SD1_CLK_LABEL                            "SD1_CLK/J24[3]"   /*!< Label */
#define BOARD_INITWIFI_SD1_CLK_NAME                                    "SD1_CLK"   /*!< Identifier name */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
#define BOARD_INITWIFI_SD1_D1_PERIPHERAL                                  USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITWIFI_SD1_D1_SIGNAL                                  usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITWIFI_SD1_D1_CHANNEL                                         1U   /*!< USDHC1 usdhc_data channel: 1 */
#define BOARD_INITWIFI_SD1_D1_PIN_NAME                             GPIO_SD_B0_03   /*!< Pin name */
#define BOARD_INITWIFI_SD1_D1_LABEL                     "SD1_D1/J24[5]/SPI_MISO"   /*!< Label */
#define BOARD_INITWIFI_SD1_D1_NAME                                      "SD1_D1"   /*!< Identifier name */

/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
#define BOARD_INITWIFI_SD1_D0_PERIPHERAL                                  USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITWIFI_SD1_D0_SIGNAL                                  usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITWIFI_SD1_D0_CHANNEL                                         0U   /*!< USDHC1 usdhc_data channel: 0 */
#define BOARD_INITWIFI_SD1_D0_PIN_NAME                             GPIO_SD_B0_02   /*!< Pin name */
#define BOARD_INITWIFI_SD1_D0_LABEL                 "SD1_D0/J24[4]/SPI_MOSI/PWM"   /*!< Label */
#define BOARD_INITWIFI_SD1_D0_NAME                                      "SD1_D0"   /*!< Identifier name */

/* GPIO_SD_B0_04 (coord H2), SD1_D2 */
#define BOARD_INITWIFI_SD1_D2_PERIPHERAL                                  USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITWIFI_SD1_D2_SIGNAL                                  usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITWIFI_SD1_D2_CHANNEL                                         2U   /*!< USDHC1 usdhc_data channel: 2 */
#define BOARD_INITWIFI_SD1_D2_PIN_NAME                             GPIO_SD_B0_04   /*!< Pin name */
#define BOARD_INITWIFI_SD1_D2_LABEL                                     "SD1_D2"   /*!< Label */
#define BOARD_INITWIFI_SD1_D2_NAME                                      "SD1_D2"   /*!< Identifier name */

/* GPIO_SD_B0_05 (coord J2), SD1_D3 */
#define BOARD_INITWIFI_SD1_D3_PERIPHERAL                                  USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITWIFI_SD1_D3_SIGNAL                                  usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITWIFI_SD1_D3_CHANNEL                                         3U   /*!< USDHC1 usdhc_data channel: 3 */
#define BOARD_INITWIFI_SD1_D3_PIN_NAME                             GPIO_SD_B0_05   /*!< Pin name */
#define BOARD_INITWIFI_SD1_D3_LABEL                                     "SD1_D3"   /*!< Label */
#define BOARD_INITWIFI_SD1_D3_NAME                                      "SD1_D3"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWifi(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */
#endif

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
